<template>

    <h2>Template Methodとは</h2>
    <p>親クラスで処理の枠組みを定め、子クラスで枠組みの具体的な内容を定めるようなパターン</p>
    <p>処理フローが殆ど同じで、その中の一部の処理内容が異なる場合に、その異なる処理の部分だけを子クラスに実装させる</p>
    <p>振る舞いに関するデザインパターン</p>
    <h3>Template Methodの構成要素</h3>
    <p>図</p>
    <p>AbstractClass</p>
    <li>抽象クラス</li>
    <li>処理全体の流れを決定するTemplate Method</li>
    <li>テンプレートメソッドで使用するAbstract Method</li>
    <p>ConcreteClass</p>
    <li>AbstractClassを継承したクラス</li>
    <li>AbstractClassで定義された抽象メソッドを実装</li>
    <h3>Template Methodのメリット・デメリット</h3>
    <li>☑️共通な処理を親クラスにまとめることができる</li>
    <li>☑️処理全体の流れは変えずに、子クラスごとに一部の処理内容を変えることができる</li>
    <li>× 処理全体の流れが親クラスに決められるので、子クラスの拡張が制限される</li>
    <li>× 子クラスで親クラスの振る舞いを変えてしまうとリスコフの置換原則に違反する</li>
    <h3>Template Methodの使い所</h3>
    <li>処理フローの全体構造は変えることなく、処理の一部のみを変更したい場合</li>
    <li>多少の違いはあるが、ほぼ同一の処理を持つクラスが複数ある場合</li>

    <p>適用例</p>

</template>
